app/controllers/messages_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def new
  	@chosen_recipient = User.find_by(id: params[:to].to_i) if params[:to]

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    recipients = User.where(id: params['recipients'])