app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
	def check
		@users = User.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
	def profile
		@user = User.find(params[:id])