app/controllers/users_controller.rb

  def index
    if params[:search]
       @users = User.search(params[:search]).order("created_at DESC")
---
SELECT "users".* FROM "users"  WHERE (company_name like '%com%')  ORDER BY created_at DESC